---
kind: other
id: Properties.T:Autodesk.Revit.DB.FilterNumericValueRule
source: html/e673f9d2-94fb-40e6-da1f-6db6872fd1d5.htm
---
# FilterNumericValueRule Properties

Specifies whether the .NET object represents a valid Revit entity.